xml/request/getIdsRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xid="http://oss.dbc.dk/ns/openxid">
  <soapenv:Header/>
  <soapenv:Body>
    <xid:getIdsRequest>
      <xid:id>
        <xid:idType>ean</xid:idType>
        <xid:idValue>1-56592-709-5</xid:idValue>
      </xid:id>
    </xid:getIdsRequest>
  </soapenv:Body>
</soapenv:Envelope>